____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
cropping2d_2 (Cropping2D)        (None, 75, 320, 3)    0           cropping2d_input_2[0][0]         
____________________________________________________________________________________________________
lambda_2 (Lambda)                (None, 75, 320, 3)    0           cropping2d_2[0][0]               
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 74, 319, 32)   416         lambda_2[0][0]                   
____________________________________________________________________________________________________
maxpooling2d_11 (MaxPooling2D)   (None, 37, 159, 32)   0           convolution2d_11[0][0]           
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 36, 158, 32)   4128        maxpooling2d_11[0][0]            
____________________________________________________________________________________________________
maxpooling2d_12 (MaxPooling2D)   (None, 18, 79, 32)    0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 17, 78, 32)    4128        maxpooling2d_12[0][0]            
____________________________________________________________________________________________________
maxpooling2d_13 (MaxPooling2D)   (None, 8, 39, 32)     0           convolution2d_13[0][0]           
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 7, 38, 64)     8256        maxpooling2d_13[0][0]            
____________________________________________________________________________________________________
maxpooling2d_14 (MaxPooling2D)   (None, 3, 19, 64)     0           convolution2d_14[0][0]           
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 2, 18, 128)    32896       maxpooling2d_14[0][0]            
____________________________________________________________________________________________________
maxpooling2d_15 (MaxPooling2D)   (None, 1, 9, 128)     0           convolution2d_15[0][0]           
____________________________________________________________________________________________________
flatten_3 (Flatten)              (None, 1152)          0           maxpooling2d_15[0][0]            
____________________________________________________________________________________________________
dense_7 (Dense)                  (None, 1024)          1180672     flatten_3[0][0]                  
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 1024)          0           dense_7[0][0]                    
____________________________________________________________________________________________________
dense_8 (Dense)                  (None, 512)           524800      dropout_5[0][0]                  
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 512)           0           dense_8[0][0]                    
____________________________________________________________________________________________________
dense_9 (Dense)                  (None, 1)             513         dropout_6[0][0]                  
====================================================================================================
Total params: 1,755,809
Trainable params: 1,755,809
Non-trainable params: 0
____________________________________________________________________________________________________